[
  {
    "videoUrl": "https://youtu.be/nnDMh-iI5zE?si=MYzBc_1ppjyJO5DZ",
    "title": "Alice Afflick-Mensah: Head of Sound at Hamilton in the West End",
    "description": "In this episode of The Five Minute Call, we delve into the world of theatre sound engineering with Alice Afflick-Mensah, who is currently the Head of Sound for Hamilton in the West End. Alice recounts her journey from studying classical music to working on one of the biggest shows in the world. She shares her experiences managing live mixes, her emotional connection with performers, handling performance anxiety, and her passion for DJing. Alice also discusses the importance of self-care and creating a supportive work environment.",
    "spotifyUrl": "https://open.spotify.com/episode/5Z4ayzzCEXOLU1pdXCsvY9?si=MsrSwZZ4RQe9CMdKSKuzBQ",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/alice-afflick-mensah-head-of-sound-at-hamilton-in/id1726937467?i=1000683812622"
  },
  {
    "videoUrl": "https://youtu.be/YiFjl0OrHjc?si=7g8M0q3f72qmCZba",
    "title": "Luke Bayer: from X-Factor to leading roles in the West End... It's not that deep!",
    "description": "In this episode we're talking to Luke Bayer about his impressive career in theatre. Starting at age 14 as a contestant on The X Factor, Luke went on to tour China before performing as Jamie in "Everybody's Talking About Jamie". He also received acclaim for his one-man show "Diva Live From Hell" - winning multiple awards. Luke shares the highs and lows of his early start, his preparation methods for new roles, and the challenges of performing solo.",
    "spotifyUrl": "https://open.spotify.com/episode/5dSGw0mOuOohLZF1UStPEw?si=t9I6Gm7URTap9dihe7crLQ",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/luke-bayer-from-x-factor-to-leading-roles-in-the-west/id1726937467?i=1000682901844"
  }
  {
    "videoUrl": "https://youtu.be/FAXX1gMK-Ds?si=Z7_YEYAjXch_oK73",
    "title": "Charlie Stemp: from Monkey no.3 in Wicked to Bert in Mary Poppins, and Panto at the Palladium",
    "description": "Join us for a very special Christmas episode of The Five Minute Call! This week, we’re on location at the London Palladium’s Robin Hood rehearsals to chat with one of musical theatre’s brightest stars, Charlie Stemp. From his award-winning performance in Half a Sixpence to Broadway’s Hello, Dolly!, and now starring in Crazy For You and Robin Hood, Charlie shares his incredible journey, career-defining moments, and the lessons he’s learned along the way.",
    "spotifyUrl": "https://open.spotify.com/episode/7r1rdPHJ7L72FYvkAAQYCR?si=ivbOYJ-FR92Fh75VWQTTGA",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/charlie-stemp-from-monkey-no-3-in-wicked-to-bert-in/id1726937467?i=1000680590492"
  },
  {
    "videoUrl": "https://youtu.be/Nvj446gSExU?si=A8js-t74UE80pie3",
    "title": "Gillyanne Kayes: World renown voice teacher and author, and co-founder of Vocal Process",
    "description": "In this episode of The 5 Minute Call, we dive deep into the life and career of Dr. Gillyanne Kayes of Vocal Process. Gillyanne shares her journey from childhood singing to teaching, the challenges faced with a significant voice problem, and her current mission to inspire and influence vocal trainers. She talks about her transformative experiences at the East 15 acting school, her influential relationships with mentors, and the path that led her back to academia to pursue a PhD. Gillyanne also discusses the importance of collaboration, the impact of her early singing teachers, and her perspective on adapting to different singing genres. This is an inspiring conversation packed with insights for anyone passionate about voice and performance.",
    "spotifyUrl": "https://open.spotify.com/episode/3GKrX4yva7A7IUnhb3hVim?si=Hi1FZU8oTA-8naKBMOolmA",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/gillyanne-kayes-world-renown-voice-teacher-and-author/id1726937467?i=1000663954011"
  },
  {
    "videoUrl": "https://youtu.be/55s9lLhZH1I?si=A5RbjC34j3WBDYvq",
    "title": "Mark Hedges: on Skates in Starlight Express to Resident Director at Phantom & Everything In-Between",
    "description": "Mark shares his captivating journey from school shows to playing major roles in productions like 'Les Misérables' and 'Starlight Express,' to becoming a resident director for iconic shows like 'The Bodyguard,' 'Mary Poppins,' and 'Phantom of the Opera.' He offers a deep dive into his transition from performing to directing, the challenges and rewards of a resident director's role, and his unique perspective on auditions. Mark also talks about the importance of collaboration, creativity, and maintaining calm in high-pressure situations. Don't miss this insightful and inspiring story of a life dedicated to theatre. ",
    "spotifyUrl": "https://open.spotify.com/episode/3whDss8xhkuIJ3hrcS77PV?si=t25iNk-nSV-PQ75vwfOMdQ",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/mark-hedges-on-skates-in-starlight-express-to-resident/id1726937467?i=1000661566027"
  },
  {
    "videoUrl": "https://youtu.be/x3ElT8_voZI?si=4nAjMMmpGUwwa_wc",
    "title": "Raffaella Covino: From In The Heights, to Rent, to Applause For Thought",
    "description": "Join us for an inspiring conversation with Raffaella Covino, an esteemed performer who has appeared in shows like In the Heights, Rent, Hairspray, and On the Town. Raffaella shares her powerful journey of dealing with mental health challenges while working in the theatre industry, which ultimately led her to establish the mental health organisation, Applause for Thought. Learn about her early passion for the arts, navigating the pressures of performing, and the importance of advocating for mental health support. You won't want to miss this touching and motivational episode.",
    "spotifyUrl": "https://open.spotify.com/episode/4sCmN4o5xsDW02XISxrpXT?si=vyvrWn0kSCCEHSD443ylvQ",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/raffaella-covino-from-in-the-heights-to-rent-to/id1726937467?i=1000660071826"
  },
  {
    "videoUrl": "https://youtu.be/0F8-sdD1NII?si=LB9rS0q02ia4Ne2r",
    "title": "Zachary James: Breaking Boundaries in Opera and Musical Theatre",
    "description": "We dive deep into the story of Zachary James, the acclaimed performer currently appearing as Hades in the West End's Hadestown. Zachary opens up about his journey from a shy kid in Florida to a celebrated musical theatre and opera star. He shares insights into his high school days, his Broadway debut, and his experiences working across different genres. Learn about his daily routines, the challenges he faced, and the importance of collaboration and creativity. Plus, hear about his unique audition experiences and the special moments that have shaped his remarkable career. Don't miss this in-depth and inspiring conversation with Zachary James!",
    "spotifyUrl": "https://open.spotify.com/episode/4bGekFRFObZwCzuV7wbF6a?si=KL8_gDA0St2WIU1n0_4ehg",
    "appleUrl": "https://podcasts.apple.com/gb/podcast/zachary-james-breaking-boundaries-in-opera-and/id1726937467?i=1000658473227"
  }
]
